app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "This is post 1"], ["updated_at", "2019-11-24 09:22:28.583614"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])

        if@post.update(post_params)